app/controllers/microposts_controller.rb

 def create
@micropost = current_user.microposts.build(params[:micropost])
 if @micropost.save
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES('hi', 1, '2014-07-01 11:08:15', '2014-07-01 11:08:15')

def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `id` = 37