app/controllers/users_controller.rb

SELECT * FROM `users` LIMIT 0, 30
SELECT count(*) AS count_all FROM `users`
---
  def index
    @title = "All users"
@users = User.paginate(:page => params[:page])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `microposts` WHERE (`microposts`.user_id = 1) ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `microposts` WHERE (`microposts`.user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`, `remember_token`, `admin`) VALUES('a', 'ab@gmail.com', '2014-07-01 07:45:41', '2014-07-01 07:45:41', '422acee2fe41844d4d80ceb1866c4c811a97ad05f279332db4eeb96c6cdb8ee0', '080783850a3280a8e8daf7f42c0261c11dc6019cf9de9b1d036ed94cc982e76b', NULL, 0)
---
  def create
    @user = User.new(params[:user])

    if @user.save

DELETE FROM `users` WHERE `id` = 2
SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
def destroy
    User.find(params[:id]).destroy

UPDATE `users` SET `email` = 'aa@gmail.com', `salt` = '3de021d9e454de0145bb0af9fff200ff1810eeb3ace44ae96b057b88d562ac77', `encrypted_password` = '1ddc3292d693b40f09b64030c726ec9c046e4376d81749a3160c05edad399b6b', `updated_at` = '2014-07-01 07:15:37' WHERE `id` = 101
---
def update

if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 6)
---
def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 6)
---
def followers
@title = "Followers"
@user = User.find(params[:id])